intelitor-v5.2/scripts/performance/artillery-ci-config.yml
# Artillery CI Configuration - Quick Load Test
# Optimized for CI environments with shorter duration
# Full tests should be run separately (artillery-config.yml)

config:
  # Target URL - use ARTILLERY_TARGET env var or default to localhost for CI
  target: '{{ $processEnvironment.ARTILLERY_TARGET || "http://localhost:4000" }}'

  phases:
    # Quick warm-up
    - duration: 30
      arrivalRate: 5
      name: "CI Warm-up"

    # Load test phase
    - duration: 60
      arrivalRate: 20
      name: "CI Load test"

    # Brief peak load
    - duration: 30
      arrivalRate: 50
      name: "CI Peak load"

    # Cooldown
    - duration: 30
      arrivalRate: 5
      name: "CI Cooldown"

  processor: "./artillery-processor.js"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  # Thresholds for CI pass/fail
  ensure:
    - p95: 500    # 95th percentile must be under 500ms
    - p99: 1000   # 99th percentile must be under 1s

scenarios:
  - name: "Health Check"
    weight: 40
    flow:
      - get:
          url: "/api/health"

  - name: "Basic API Flow"
    weight: 30
    flow:
      - get:
          url: "/api/alarms"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/devices"
          expect:
            - statusCode: 200

  - name: "Dashboard Analytics"
    weight: 30
    flow:
      - get:
          url: "/api/v1/statistics"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/v1/alarms/active"
          expect:
            - statusCode: 200