intelitor-v5.2/scripts/performance/artillery-spike-config.yml
# Artillery Spike Testing Configuration
# Purpose: Test system behavior under sudden traffic spikes
# Duration: ~15 minutes
# STAMP Compliance: SC-PRF-051, SC-EMR-057

config:
  target: '{{ $processEnvironment.ARTILLERY_TARGET || "http://localhost:4000" }}'

  phases:
    # Baseline (2 minutes)
    - duration: 120
      arrivalRate: 10
      name: "Spike Baseline"

    # First spike (30 seconds - 10x increase)
    - duration: 30
      arrivalRate: 100
      name: "Spike 1: 10x"

    # Recovery (2 minutes)
    - duration: 120
      arrivalRate: 10
      name: "Recovery 1"

    # Second spike (30 seconds - 20x increase)
    - duration: 30
      arrivalRate: 200
      name: "Spike 2: 20x"

    # Recovery (2 minutes)
    - duration: 120
      arrivalRate: 10
      name: "Recovery 2"

    # Third spike (1 minute sustained high load)
    - duration: 60
      arrivalRate: 150
      name: "Spike 3: Sustained High"

    # Recovery (2 minutes)
    - duration: 120
      arrivalRate: 10
      name: "Recovery 3"

    # Oscillating load (3 minutes)
    - duration: 30
      arrivalRate: 50
      name: "Oscillate High"
    - duration: 30
      arrivalRate: 10
      name: "Oscillate Low"
    - duration: 30
      arrivalRate: 80
      name: "Oscillate Peak"
    - duration: 30
      arrivalRate: 10
      name: "Oscillate Low 2"
    - duration: 30
      arrivalRate: 60
      name: "Oscillate Mid"
    - duration: 30
      arrivalRate: 10
      name: "Oscillate Final"

    # Cooldown (1 minute)
    - duration: 60
      arrivalRate: 5
      name: "Spike Cooldown"

  processor: "./artillery-processor.js"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  # Spike thresholds - expect some degradation but not failure
  ensure:
    - p95: 2000     # Allow higher latency during spikes
    - p99: 5000     # 99th percentile under 5s
    - http.codes.200: 95  # At least 95% success rate

scenarios:
  # Health checks (fast, lightweight)
  - name: "Spike Health Check"
    weight: 50
    flow:
      - get:
          url: "/api/health"

  # Core API (realistic traffic)
  - name: "Spike Core API"
    weight: 35
    flow:
      - get:
          url: "/api/alarms"
      - get:
          url: "/api/devices"

  # Heavy queries (stress test)
  - name: "Spike Heavy Queries"
    weight: 15
    flow:
      - get:
          url: "/api/v1/statistics"
      - get:
          url: "/api/v1/alarms/active"